ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263P/UART_UART_52300000h.xml
<module name="UART" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="UART_DLL" acronym="UART_DLL" offset="0" width="32" description="Divisor Latches Low Register.">
		<bitfield id="CLOCK_LSB" width="8" begin="7" end="0" resetval="0x0" description="Used to store the 8-bit LSB divisor value" range="7:0" rwaccess="R/W"/>
	</register><register id="UART_RHR" acronym="UART_RHR" offset="0" width="32" description="The receiver section consists of the receiver holding register (RHR) and the receiver shift register. The RHR is actually a 64-byte FIFO. The receiver shift register receives serial data from RX input. The data is converted to parallel data and moved to the RHR. If the FIFO is disabled location zero of the FIFO is used to store the single data character. Note: If an overflow occurs the data in the RHR is not overwritten.">
		<bitfield id="RHR" width="8" begin="7" end="0" resetval="0x0" description="Receive holding register" range="7:0" rwaccess="R"/>
	</register><register id="UART_THR" acronym="UART_THR" offset="0" width="32" description="The transmitter section consists of the transmit holding register (THR) and the transmit shift register. The transmit holding register is actually a 64-byte FIFO. The LH writes data to the THR. The data is placed into the transmit shift register where it is shifted out serially on the TX output. If the FIFO is disabled location zero of the FIFO is used to store the data. ">
		<bitfield id="THR" width="8" begin="7" end="0" resetval="0x0" description="TRANSMIT HOLDING REGISTER" range="7:0" rwaccess="W"/>
	</register><register id="UART_DLH" acronym="UART_DLH" offset="4" width="32" description="Divisor Latches High Register.">
		<bitfield id="CLOCK_MSB" width="8" begin="7" end="0" resetval="0x0" description="Used to store the 8-bit MSB divisor value" range="7:0" rwaccess="R/W"/>
	</register><register id="UART_IER_CIR" acronym="UART_IER_CIR" offset="4" width="32" description="The interrupt enable register (IER) can be programmed to enable/disable any interrupt. There are 6 types of interrupt in these modes, TX status, status FIFO interrupt, RX overrun, last byte in RX FIFO, THR interrupt and RHR interrupt and they can be enabled/disabled individually.">
		<bitfield id="NOT_USED2" width="2" begin="7" end="6" resetval="0x0" description="" range="7:6" rwaccess="R/W"/>
	<bitfield id="TX_STATUS_IT" width="1" begin="5" end="5" resetval="0x0" description=" 0      Disables the TX status interrupt.1      Enables the TX status interrupt." range="5" rwaccess="R/W"/>
	<bitfield id="NOT_USED1" width="1" begin="4" end="4" resetval="0x0" description="" range="4" rwaccess="R/W"/>
	<bitfield id="RX_OVERRUN_IT" width="1" begin="3" end="3" resetval="0x0" description=" 0      Disables the RX overrun interrupt.1      Enables the RX overrun interrupt." range="3" rwaccess="R/W"/>
	<bitfield id="RX_STOP_IT" width="1" begin="2" end="2" resetval="0x0" description=" 0      Disables the receive stop interrupt.1      Enables the receive stop interrupt." range="2" rwaccess="R/W"/>
	<bitfield id="THR_IT" width="1" begin="1" end="1" resetval="0x0" description=" 0      Disables the THR interrupt.1      Enables the THR interrupt." range="1" rwaccess="R/W"/>
	<bitfield id="RHR_IT" width="1" begin="0" end="0" resetval="0x0" description=" 0      Disables the RHR interrupt.1      Enables the RHR interrupt." range="0" rwaccess="R/W"/>
	</register><register id="UART_IER_IRDA" acronym="UART_IER_IRDA" offset="4" width="32" description="The interrupt enable register (IER) can be programmed to enable/disable any interrupt. There are 8 types of interrupt in these modes, received EOF, LSR interrupt, TX status, status FIFO interrupt, RX overrun, last byte in RX FIFO, THR interrupt and RHR interrupt and they can be enabled/disabled individually.">
		<bitfield id="EOF_IT" width="1" begin="7" end="7" resetval="0x0" description=" 0      Disables the received EOF interrupt.1      Enables the received EOF interrupt." range="7" rwaccess="R/W"/>
	<bitfield id="LINE_STS_IT" width="1" begin="6" end="6" resetval="0x0" description=" 0      Disables the receiver line status       interrupt.1      Enables the receiver line status interrupt." range="6" rwaccess="R/W"/>
	<bitfield id="TX_STATUS_IT" width="1" begin="5" end="5" resetval="0x0" description=" 0      Disables the TX status interrupt.1      Enables the TX status interrupt." range="5" rwaccess="R/W"/>
	<bitfield id="STS_FIFO_TRIG_IT" width="1" begin="4" end="4" resetval="0x0" description=" 0      Disables the status FIFO trigger level       interrupt.1      Enables the status FIFO trigger level       interrupt." range="4" rwaccess="R/W"/>
	<bitfield id="RX_OVERRUN_IT" width="1" begin="3" end="3" resetval="0x0" description=" 0      Disables the RX overrun interrupt.1      Enables the RX overrun interrupt." range="3" rwaccess="R/W"/>
	<bitfield id="LAST_RX_BYTE_IT" width="1" begin="2" end="2" resetval="0x0" description=" 0      Disables the last byte of frame in RX FIFO       interrupt.1      Enables the last byte of frame in RX FIFO       interrupt." range="2" rwaccess="R/W"/>
	<bitfield id="THR_IT" width="1" begin="1" end="1" resetval="0x0" description=" 0      Disables the THR interrupt.1      Enables the THR interrupt." range="1" rwaccess="R/W"/>
	<bitfield id="RHR_IT" width="1" begin="0" end="0" resetval="0x0" description=" 0      Disables the RHR interrupt.1      Enables the RHR interrupt." range="0" rwaccess="R/W"/>
	</register><register id="UART_IER_UART" acronym="UART_IER_UART" offset="4" width="32" description="The interrupt enable register (IER) can be programmed to enable/disable any interrupt. There are seven types of interrupt in this mode: receiver error, RHR interrupt, THR interrupt, XOFF received and CTS*/RTS* change of state from low to high. Each interrupt can be enabled/disabled individually. There is also a sleep mode enable bit.">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="" range="31:8" rwaccess="R"/>
	<bitfield id="CTS_IT" width="1" begin="7" end="7" resetval="0x0" description=" 0      Disables the CTS* interrupt1      Enables the CTS* interrupt" range="7" rwaccess="R/W"/>
	<bitfield id="RTS_IT" width="1" begin="6" end="6" resetval="0x0" description=" 0      Disables the RTS* interrupt1      Enables the RTS* interrupt" range="6" rwaccess="R/W"/>
	<bitfield id="XOFF_IT" width="1" begin="5" end="5" resetval="0x0" description=" 0      Disables the XOFF interrupt1      Enables the XOFF interrupt" range="5" rwaccess="R/W"/>
	<bitfield id="SLEEP_MODE" width="1" begin="4" end="4" resetval="0x0" description=" 0      Disables sleep mode1      Enables sleep mode (stop baud rate clock       when the module is inactive)" range="4" rwaccess="R/W"/>
	<bitfield id="MODEM_STS_IT" width="1" begin="3" end="3" resetval="0x0" description=" 0      Disables the modem status register       interrupt1      Enables the modem status register interrupt" range="3" rwaccess="R/W"/>
	<bitfield id="LINE_STS_IT" width="1" begin="2" end="2" resetval="0x0" description=" 0      Disables the receiver line status interrupt1      Enables the receiver line status interrupt" range="2" rwaccess="R/W"/>
	<bitfield id="THR_IT" width="1" begin="1" end="1" resetval="0x0" description=" 0      Disables the THR interrupt1      Enables the THR interrupt" range="1" rwaccess="R/W"/>
	<bitfield id="RHR_IT" width="1" begin="0" end="0" resetval="0x0" description=" 0      Disables the RHR interrupt and time out       interrupt.1      Enables the RHR interrupt and time out       interrupt." range="0" rwaccess="R/W"/>
	</register><register id="UART_EFR" acronym="UART_EFR" offset="8" width="32" description="Enhanced Feature Register.">
		<bitfield id="AUTO_CTS_EN" width="1" begin="7" end="7" resetval="0x0" description="Auto-CTS enable bit.0:Normal operation.1:Auto-CTS flow control is enabled i.e. transmission is halted when the CTS* pin is high (inactive)." range="7" rwaccess="R/W"/>
	<bitfield id="AUTO_RTS_EN" width="1" begin="6" end="6" resetval="0x0" description="Auto-RTS enable bit.0:Normal operation.1:Auto- RTS flow control is enabled i.e. RTS* pin goes high (inactive) when the receiver FIFO HALT trigger level, TCR[3:0], is reached, and goes low (active) when the receiver FIFO RESTORE transmission trigger level is reached." range="6" rwaccess="R/W"/>
	<bitfield id="SPECIAL_CHAR_DETECT" width="1" begin="5" end="5" resetval="0x0" description="0: Normal operation.1:Special character detect enable. Received data is compared with XOFF2 data. If a match occurs the received data is transferred to RX FIFO and IIR bit 4 is set to 1 to indicate a special character has been detected." range="5" rwaccess="R/W"/>
	<bitfield id="ENHANCED_EN" width="1" begin="4" end="4" resetval="0x0" description="Enhanced functions write enable bit.0:Disables Writing to IER bits 4-7, FCR bits 4-5, and MCR bits 5-7.1:Enables Writing to IER bits 4-7, FCR bits 4-5, and MCR bits 5-7." range="4" rwaccess="R/W"/>
	<bitfield id="SW_FLOW_CONTROL" width="4" begin="3" end="0" resetval="0x0" description="Combinations of Software flow control can be selected by programming bit 3 - bit 0. See Software Flow Control Options" range="3:0" rwaccess="R/W"/>
	</register><register id="UART_FCR" acronym="UART_FCR" offset="8" width="32" description="Notes:	Bits 4 and 5 can only be written to when EFR[4] = 1	Bits 0 to 3 can be changed only when the baud clock is not running (DLL and DLH set to 0)	See Table 31 for FCR[5:4] setting restriction when SCR[6]=1	See Table 32 for FCR[7:6] setting restriction when SCR[7]=1">
		<bitfield id="RX_FIFO_TRIG" width="2" begin="7" end="6" resetval="0x0" description="Sets the trigger level for the RX FIFO:If SCR[7] = 0 and TLR[7:4] =0000br#00:  8 charactersbr#01:16 charactersbr#10:56 charactersbr#11:60 charactersIf SCR[7] = 0 and TLR[7:4] !=0000 RX_FIFO_TRIG is not considered.If SCR[7]=1, RX_FIFO_TRIG is 2 LSB of the trigger level [1-63 on 6 bits] with the granularity 1." range="7:6" rwaccess="W"/>
	<bitfield id="TX_FIFO_TRIG" width="2" begin="5" end="4" resetval="0x0" description="Sets the trigger level for the TX FIFO:If SCR[6] = 0 and TLR[3:0] =0000br#00:  8 spacesbr#01:16 spacesbr#10:32 spacesbr#11:56 spacesIf SCR[6] = 0 and TLR[3:0] !=0000 TX_FIFO_TRIG is not considered.If SCR[6]=1, TX_FIFO_TRIG is 2 LSB of the trigger level [1-63 on 6 bits] with the granularity 1" range="5:4" rwaccess="W"/>
	<bitfield id="DMA_MODE" width="1" begin="3" end="3" resetval="0x0" description="This register is considered if SCR[0] = 0. 0      DMA_MODE 0 (No DMA)1      DMA_MODE 1 (UART_nDMA_REQ[0] in TX,       UART_nDMA_REQ[1] in RX)" range="3" rwaccess="W"/>
	<bitfield id="TX_FIFO_CLEAR" width="1" begin="2" end="2" resetval="0x0" description=" 0      No change1      Clears the transmit FIFO and resets its       counter logic to zero. Returns to zero       after clearing FIFO." range="2" rwaccess="W"/>
	<bitfield id="RX_FIFO_CLEAR" width="1" begin="1" end="1" resetval="0x0" description=" 0      No change1      Clears the receive FIFO and resets its       counter logic to zero. Returns to zero       after clearing FIFO." range="1" rwaccess="W"/>
	<bitfield id="FIFO_EN" width="1" begin="0" end="0" resetval="0x0" description=" 0      Disables the transmit and receive FIFOs.       The transmit and receive holding registers       are one byte FIFOs.1      : Enables the transmit and receive       FIFOs.The transmit and receive holding       registers are 64-bytes FIFOs." range="0" rwaccess="W"/>
	</register><register id="UART_IIR_CIR" acronym="UART_IIR_CIR" offset="8" width="32" description="The IIR is a read-only register, which provides the source of the interrupt in a prioritized manner.">
		<bitfield id="TX_STATUS_IT" width="1" begin="5" end="5" resetval="0x0" description=" 0      TX status interrupt inactive1      TX status interrupt active" range="5" rwaccess="R"/>
	<bitfield id="RX_OE_IT" width="1" begin="3" end="3" resetval="0x0" description=" 0      RX overrun interrupt inactive1      RX overrun interrupt active" range="3" rwaccess="R"/>
	<bitfield id="RX_STOP_IT" width="1" begin="2" end="2" resetval="0x0" description=" 0      Receive stop interrupt inactive1      Receive stop interrupt active" range="2" rwaccess="R"/>
	<bitfield id="THR_IT" width="1" begin="1" end="1" resetval="0x0" description=" 0      THR interrupt inactive1      THR interrupt active" range="1" rwaccess="R"/>
	<bitfield id="RHR_IT" width="1" begin="0" end="0" resetval="0x0" description=" 0      RHR interrupt inactive1      RHR interrupt active" range="0" rwaccess="R"/>
	</register><register id="UART_IIR_IRDA" acronym="UART_IIR_IRDA" offset="8" width="32" description="The IIR is a read-only register, which provides the source of the interrupt in a prioritized manner.">
		<bitfield id="EOF_IT" width="1" begin="7" end="7" resetval="0x0" description=" 0      Received EOF interrupt inactive1      Received EOF interrupt active" range="7" rwaccess="R"/>
	<bitfield id="LINE_STS_IT" width="1" begin="6" end="6" resetval="0x0" description=" 0      Receiver line status interrupt inactive1      Receiver line status interrupt active" range="6" rwaccess="R"/>
	<bitfield id="TX_STATUS_IT" width="1" begin="5" end="5" resetval="0x0" description=" 0      TX status interrupt inactive1      TX status interrupt active" range="5" rwaccess="R"/>
	<bitfield id="STS_FIFO_IT" width="1" begin="4" end="4" resetval="0x0" description=" 0      Status FIFO trigger level interrupt       inactive1      Status FIFO trigger level interrupt active" range="4" rwaccess="R"/>
	<bitfield id="RX_OE_IT" width="1" begin="3" end="3" resetval="0x0" description=" 0      RX overrun interrupt inactive1      RX overrun interrupt active" range="3" rwaccess="R"/>
	<bitfield id="RX_FIFO_LAST_BYTE_IT" width="1" begin="2" end="2" resetval="0x0" description=" 0      Last byte of frame in RX FIFO interrupt       inactive1      Last byte of frame in RX FIFO interrupt       active" range="2" rwaccess="R"/>
	<bitfield id="THR_IT" width="1" begin="1" end="1" resetval="0x0" description=" 0      THR interrupt inactive1      THR interrupt active" range="1" rwaccess="R"/>
	<bitfield id="RHR_IT" width="1" begin="0" end="0" resetval="0x0" description=" 0      RHR interrupt inactive1      RHR interrupt active" range="0" rwaccess="R"/>
	</register><register id="UART_IIR_UART" acronym="UART_IIR_UART" offset="8" width="32" description="The IIR is a read-only register, which provides the source of the interrupt in a prioritized manner.">
		<bitfield id="FCR_MIRROR" width="2" begin="7" end="6" resetval="0x0" description="Mirror the contents of FCR[0] on both bits." range="7:6" rwaccess="R"/>
	<bitfield id="IT_TYPE" width="5" begin="5" end="1" resetval="0x0" description=" 0      Modem Interrupt. Priority=41      THR interrupt.  Priority=32      RHR interrupt.  Priority=23      Receiver line status error.  Priority=36      Rx timeout.  Priority=28      Xoff/Special character.  Priority=516     CTS, RTS, DSR change state from active       (low) to inactive (high). Priority=6" range="5:1" rwaccess="R"/>
	<bitfield id="IT_PENDING" width="1" begin="0" end="0" resetval="0x1" description=" 0      An interrupt is pending1      No interrupt is pending" range="0" rwaccess="R"/>
	</register><register id="UART_LCR" acronym="UART_LCR" offset="12" width="32" description="LCR[6:0] define parameters of the transmission and reception.Note: As soon as LCR[6] is set to 1, the TX line is forced to 0 and remains in this state as long as LCR[6] = 1.">
		<bitfield id="DIV_EN" width="1" begin="7" end="7" resetval="0x0" description=" 0      Normal operating condition1      Divisor latch enable. Allows to access to       DLL, DLH and other registers (refer to the       registers mapping)" range="7" rwaccess="R/W"/>
	<bitfield id="BREAK_EN" width="1" begin="6" end="6" resetval="0x0" description="Break control bit. 0      Normal operating condition.1      Forces the transmitter output to go low to       alert the communication terminal" range="6" rwaccess="R/W"/>
	<bitfield id="PARITY_TYPE2" width="1" begin="5" end="5" resetval="0x0" description="Selects the forced parity format [if LCR[3] = 1]. If LCR[5] = 1 and LCR[4] = 0, the parity bit is forced to 1 in the transmitted and received data. If LCR[5] = 1 and LCR[4] = 1, the parity bit is forced to 0 in the transmitted and received data." range="5" rwaccess="R/W"/>
	<bitfield id="PARITY_TYPE1" width="1" begin="4" end="4" resetval="0x0" description=" 0      Odd parity is generated (if LCR[3] = 1)1      Even parity is generated (if LCR[3] = 1)" range="4" rwaccess="R/W"/>
	<bitfield id="PARITY_EN" width="1" begin="3" end="3" resetval="0x0" description=" 0      No parity1      A parity bit is generated during       transmission and the receiver checks for       received parity." range="3" rwaccess="R/W"/>
	<bitfield id="NB_STOP" width="1" begin="2" end="2" resetval="0x0" description="Specifies the number of stop bits: 0      1 stop bits (word length = 5, 6, 7, 8)1      1.5 stop bits (word length = 5) in USART       mode. 2 stop bits (word length = 6, 7, 8)" range="2" rwaccess="R/W"/>
	<bitfield id="CHAR_LENGTH" width="2" begin="1" end="0" resetval="0x0" description="Specifies the word length to be transmitted or received. 0      5 bits1      6 bits2      7 bits3      8 bits" range="1:0" rwaccess="R/W"/>
	</register><register id="UART_MCR" acronym="UART_MCR" offset="16" width="32" description="MCR[3:0] controls the interface with the modem, data set or peripheral device that is emulating the modem. ">
		<bitfield id="RESERVED" width="1" begin="7" end="7" resetval="0x0" description="" range="7" rwaccess="R"/>
	<bitfield id="TCR_TLR" width="1" begin="6" end="6" resetval="0x0" description=" 0      No action1      Enables access to the TCR and TLR       registers." range="6" rwaccess="R/W"/>
	<bitfield id="XON_EN" width="1" begin="5" end="5" resetval="0x0" description=" 0      Disable 'XON any' function1      Enable 'XON any' function" range="5" rwaccess="R/W"/>
	<bitfield id="LOOPBACK_EN" width="1" begin="4" end="4" resetval="0x0" description=" 0      Normal operating mode1      Enable local loopback mode (internal). In       this mode the MCR[3:0] signals are looped       back into MSR[7:4]. The transmit output is       looped back to the receive input internally" range="4" rwaccess="R/W"/>
	<bitfield id="CD_STS_CH" width="1" begin="3" end="3" resetval="0x0" description=" 0      In loopback forces DCD* input high and IRQ       outputs to inactive state.1      In loopback forces DCD* input low and IRQ       outputs to inactive state." range="3" rwaccess="R/W"/>
	<bitfield id="RI_STS_CH" width="1" begin="2" end="2" resetval="0x0" description=" 0      In loopback forces RI* input high.1      In loopback forces RI* input low." range="2" rwaccess="R/W"/>
	<bitfield id="RTS" width="1" begin="1" end="1" resetval="0x0" description="In loop back controls MSR[4].If auto-RTS is enabled the RTS* output is controlled by hardware flow control. 0      Force RTS* output to inactive (high).1      Force RTS* output to active (low)." range="1" rwaccess="R/W"/>
	<bitfield id="DTR" width="1" begin="0" end="0" resetval="0x0" description=" 0      Force DTR* output to inactive (high).1      Force DTR* output to active (low)." range="0" rwaccess="R/W"/>
	</register><register id="UART_XON1_ADDR1" acronym="UART_XON1_ADDR1" offset="16" width="32" description="XON1/ADDR1 Register.">
		<bitfield id="XON_WORD1" width="8" begin="7" end="0" resetval="0x0" description="Used to store the 8-bit XON1 character in UART modes and ADDR1 address 1 for IrDA modes." range="7:0" rwaccess="R/W"/>
	</register><register id="UART_LSR_CIR" acronym="UART_LSR_CIR" offset="20" width="32" description="IR CIR mode line status register.">
		<bitfield id="THR_EMPTY" width="1" begin="7" end="7" resetval="0x1" description=" 0      Transmit holding register (TX FIFO) is not       empty1      Transmit hold register (TX FIFO) is empty.       The transmission is not necessarily       completed" range="7" rwaccess="R"/>
	<bitfield id="RESERVED" width="1" begin="6" end="6" resetval="0x0" description="" range="6" rwaccess="R"/>
	<bitfield id="RX_STOP" width="1" begin="5" end="5" resetval="0x0" description="The RX_STOP is generated based on the value set in the BOF Length register (EBLR). It is cleared on a single read of the LSR register 0      Reception is on going or waiting for a new       frame1      Reception is completed" range="5" rwaccess="R"/>
	<bitfield id="RX_FIFO_E" width="1" begin="0" end="0" resetval="0x1" description=" 0      No data in the receive FIFO1      At least one data character in the RX FIFO" range="0" rwaccess="R"/>
	</register><register id="UART_LSR_IRDA" acronym="UART_LSR_IRDA" offset="20" width="32" description="IR-IRDA mode line status register.">
		<bitfield id="THR_EMPTY" width="1" begin="7" end="7" resetval="0x1" description=" 0      Transmit holding register (TX FIFO) is not       empty1      Transmit hold register (TX FIFO) is empty.       The transmission is not necessarily       completed" range="7" rwaccess="R"/>
	<bitfield id="STS_FIFO_FULL" width="1" begin="6" end="6" resetval="0x0" description=" 0      Status FIFO not full1      Status FIFO full" range="6" rwaccess="R"/>
	<bitfield id="RX_LAST_BYTE" width="1" begin="5" end="5" resetval="0x0" description=" 0      The RX FIFO (RHR) does not contain the last       byte of the frame to be read1      The RX FIFO (RHR) contains the last byte of       the frame to be read.This bit is only set       when the last byte of a frame is available       to be read. It is used to determine the       frame boundary. It is cleared on a single       read of the LSR register" range="5" rwaccess="R"/>
	<bitfield id="FRAME_TOO_LONG" width="1" begin="4" end="4" resetval="0x0" description=" 0      No frame-too-long error in frame1      Frame-too-long error in the frame at the       top of the STATUS FIFO, [next character to       be read]. This bit is set to 1 when a frame       exceeding the maximum length (set by RXFLH       and RXFLL registers) has been received.       When this error is detected, current frame       reception is terminated. Reception is       stopped until the next START flag is       detected" range="4" rwaccess="R"/>
	<bitfield id="ABORT" width="1" begin="3" end="3" resetval="0x0" description=" 0      No abort pattern error in frame1      Abort pattern is received. SIR &#38; MIR:       Abort pattern. FIR: Illegal symbol" range="3" rwaccess="R"/>
	<bitfield id="CRC" width="1" begin="2" end="2" resetval="0x0" description=" 0      No CRC error in frame1      CRC error in the frame at the top of the       STATUS FIFO (next character to be read)" range="2" rwaccess="R"/>
	<bitfield id="STS_FIFO_E" width="1" begin="1" end="1" resetval="0x1" description=" 0      Status FIFO not empty1      Status FIFO empty" range="1" rwaccess="R"/>
	<bitfield id="RX_FIFO_E" width="1" begin="0" end="0" resetval="0x1" description=" 0      No data in the receive FIFO1      At least one data character in the RX FIFO" range="0" rwaccess="R"/>
	</register><register id="UART_LSR_UART" acronym="UART_LSR_UART" offset="20" width="32" description="">
		<bitfield id="RX_FIFO_STS" width="1" begin="7" end="7" resetval="0x0" description=" 0      Normal operation1      At least one parity error, framing error or       break indication in the RX FIFO. Bit 7 is       cleared when no more errors are present in       the RX FIFO." range="7" rwaccess="R"/>
	<bitfield id="TX_SR_E" width="1" begin="6" end="6" resetval="0x1" description=" 0      Transmitter hold (TX FIFO) and shift       registers are not empty.1      Transmitter hold (TX FIFO) and shift       registers are empty" range="6" rwaccess="R"/>
