ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263P/UART_UART_52300000h.xml
	<bitfield id="TX_FIFO_E" width="1" begin="5" end="5" resetval="0x1" description=" 0      Transmit hold register (TX FIFO) is not       empty1      Transmit hold register (TX FIFO) is empty.       The transmission is not necessarily       completed." range="5" rwaccess="R"/>
	<bitfield id="RX_BI" width="1" begin="4" end="4" resetval="0x0" description=" 0      No break condition1      A break was detected while the data being       read from the RX FIFO was being received.       (i.e. RX input was low for one character +       1 bit time frame)." range="4" rwaccess="R"/>
	<bitfield id="RX_FE" width="1" begin="3" end="3" resetval="0x0" description=" 0      No framing error in data being read from RX       FIFO.1      Framing error occurred in data being read       from RX FIFO.(received data did not have a       valid stop bit)" range="3" rwaccess="R"/>
	<bitfield id="RX_PE" width="1" begin="2" end="2" resetval="0x0" description=" 0      No parity error in data being read from RX       FIFO.1      Parity error in data being read from RX       FIFO" range="2" rwaccess="R"/>
	<bitfield id="RX_OE" width="1" begin="1" end="1" resetval="0x0" description=" 0      No overrun error1      Overrun error has occurred. Set when the       character held in the receive shift       register is not transferred to the RX FIFO.       This case can occurs only when receive FIFO       is full." range="1" rwaccess="R"/>
	<bitfield id="RX_FIFO_E" width="1" begin="0" end="0" resetval="0x0" description="Line Status Register 0      No data in the receive FIFO1      At least one data character in the RX FIFO" range="0" rwaccess="R"/>
	</register><register id="UART_XON2_ADDR2" acronym="UART_XON2_ADDR2" offset="20" width="32" description="XON2/ADDR2 Register.">
		<bitfield id="XON_WORD2" width="8" begin="7" end="0" resetval="0x0" description="Used to store the 8-bit XON2 character in UART modes and ADDR2 address 2 for IrDA modes." range="7:0" rwaccess="R/W"/>
	</register><register id="UART_MSR" acronym="UART_MSR" offset="24" width="32" description="This register provides information about the current state of the control lines from the modem, data set or peripheral device to the LH. It also indicates when a control input from the modem changes state.">
		<bitfield id="NCD_STS" width="1" begin="7" end="7" resetval="0x0" description="This bit is the complement of the DCD* input. In loop-back mode it is equivalent to MCR[3] " range="7" rwaccess="R"/>
	<bitfield id="NRI_STS" width="1" begin="6" end="6" resetval="0x0" description="This bit is the complement of the RI* input. In loop-back mode it is equivalent to MCR[2]" range="6" rwaccess="R"/>
	<bitfield id="NDSR_STS" width="1" begin="5" end="5" resetval="0x0" description="This bit is the complement of the DSR* input. In loop-back mode, it is equivalent to MCR[0]" range="5" rwaccess="R"/>
	<bitfield id="NCTS_STS" width="1" begin="4" end="4" resetval="0x0" description="This bit is the complement of the CTS* input. In loop-back mode it is equivalent to MCR[1]" range="4" rwaccess="R"/>
	<bitfield id="DCD_STS" width="1" begin="3" end="3" resetval="0x0" description="Indicates that DCD* input [or MCR[3] in loop back] has changed. Cleared on a read." range="3" rwaccess="R"/>
	<bitfield id="RI_STS" width="1" begin="2" end="2" resetval="0x0" description="Indicates that RI* input [or MCR[2] in loop back] has changed state from low to high. Cleared on a read." range="2" rwaccess="R"/>
	<bitfield id="DSR_STS" width="1" begin="1" end="1" resetval="0x0" description=" 1      Indicates that DSR* input (or MCR[0] in       loop back) has changed state. Cleared on a       read" range="1" rwaccess="R"/>
	<bitfield id="CTS_STS" width="1" begin="0" end="0" resetval="0x0" description=" 1      Indicates that CTS* input (or MCR[1] in       loop back) has changed state. Cleared on a       read." range="0" rwaccess="R"/>
	</register><register id="UART_TCR" acronym="UART_TCR" offset="24" width="32" description="Transmission Control Register.">
		<bitfield id="RX_FIFO_TRIG_START" width="4" begin="7" end="4" resetval="0x0" description="RX FIFO trigger level to RESTORE transmission (0 - 60)" range="7:4" rwaccess="R/W"/>
	<bitfield id="RX_FIFO_TRIG_HALT" width="4" begin="3" end="0" resetval="0x15" description="RX FIFO trigger level to HALT transmission (0 - 60)" range="3:0" rwaccess="R/W"/>
	</register><register id="UART_XOFF1" acronym="UART_XOFF1" offset="24" width="32" description="XOFF1 Register.">
		<bitfield id="XOFF_WORD1" width="8" begin="7" end="0" resetval="0x0" description="Used to store the 8-bit XOFF1 character in used in UART modes." range="7:0" rwaccess="R/W"/>
	</register><register id="UART_SPR" acronym="UART_SPR" offset="28" width="32" description="This read/write register does not control the module in anyway. It is intended as a scratchpad register to be used by the programmer to hold temporary data.">
		<bitfield id="SPR_WORD" width="8" begin="7" end="0" resetval="0x0" description="Scratchpad register" range="7:0" rwaccess="R/W"/>
	</register><register id="UART_TLR" acronym="UART_TLR" offset="28" width="32" description="Trigger Level Register.">
		<bitfield id="RX_FIFO_TRIG_DMA" width="4" begin="7" end="4" resetval="0x0" description="Receive FIFO trigger level" range="7:4" rwaccess="R/W"/>
	<bitfield id="TX_FIFO_TRIG_DMA" width="4" begin="3" end="0" resetval="0x0" description="Transmit FIFO trigger level" range="3:0" rwaccess="R/W"/>
	</register><register id="UART_XOFF2" acronym="UART_XOFF2" offset="28" width="32" description="XOFF2 Register.">
		<bitfield id="XOFF_WORD2" width="8" begin="7" end="0" resetval="0x0" description="Used to store the 8-bit XOFF2 character in used in UART modes." range="7:0" rwaccess="R/W"/>
	</register><register id="UART_MDR1" acronym="UART_MDR1" offset="32" width="32" description="The mode of operation can be programmed by writing to MDR1[2:0] and therefore the MDR1 must be programmed on start-up after configuration of the configuration registers (DLL, DLH, LCR). The value of MDR1[2:0] must not be changed again during normal operation. Note: If the module is disabled by setting the MODE_SELECT field to.">
		<bitfield id="FRAME_END_MODE" width="1" begin="7" end="7" resetval="0x0" description="IrDA mode only. 0      Frame-length method1      Set EOT bit method" range="7" rwaccess="R/W"/>
	<bitfield id="SIP_MODE" width="1" begin="6" end="6" resetval="0x0" description="MIR/FIR modes only. 0      Manual SIP mode: SIP is generated with the       control of ACREG[3]1      Automatic SIP mode: SIP is generated after       each transmission." range="6" rwaccess="R/W"/>
	<bitfield id="SCT" width="1" begin="5" end="5" resetval="0x0" description="Store and control the transmission 0      Starts the Infrared transmission as soon as       a value is written to THR1      Starts the Infrared transmission with the       control of ACREG[2]. Note: before starting       any transmission, there must be no       reception on going." range="5" rwaccess="R/W"/>
	<bitfield id="SET_TXIR" width="1" begin="4" end="4" resetval="0x0" description="Used to configure the infrared transceiver. 0      No action if MDR2[7]=0. TXIR pin output is       forced low if MDR2[7]=11      TXIR pin output is forced high (not       dependant of MDR2[7] value)." range="4" rwaccess="R/W"/>
	<bitfield id="IR_SLEEP" width="1" begin="3" end="3" resetval="0x0" description=" 0      IrDA/CIR sleep mode disabled1      IrDA/CIR sleep mode enabled" range="3" rwaccess="R/W"/>
	<bitfield id="MODE_SELECT" width="3" begin="2" end="0" resetval="0x7" description=" 0      UART 16x mode1      SIR mode2      UART 16x auto-baud3      UART 13x mode4      MIR mode5      FIR mode6      CIR mode7      Disable (default state)" range="2:0" rwaccess="R/W"/>
	</register><register id="UART_MDR2" acronym="UART_MDR2" offset="36" width="32" description="IR-IrDA and IR-CIR modes only.MDR2[0] describes the status of the interrupt in IIR[5]. The IRTX_UNDERRUN bit should be read after an IIR[5] TX_STATUS_IT interrupt has occurred. The bits [2:1] of this register sets the trigger level for the frame status FIFO (8 entries) and must be programmed before the mode is programmed in MDR1[2:0].Note: The MDR2[6] gives the flexibility to invert the RX pin inside the UART module to ensure that the protocol at the input of the transceiver module has the same polarity at module level. By default, the RX pin is inverted because most of transceiver invert the IR receive pin.">
		<bitfield id="SET_TXIR_ALT" width="1" begin="7" end="7" resetval="0x0" description="Provide alternate functionnality for MDR1[4] [SET_TXIR] 0      Normal mode1      Alternate mode for SET_TXIR" range="7" rwaccess="R/W"/>
	<bitfield id="IRRXINVERT" width="1" begin="6" end="6" resetval="0x0" description="Only for IR mode [IRDA &#38; CIR]Invert RX pin inside the module before the voting or sampling system logic of the infra red block. This will not effect the RX path in UART Modem modes. 0      inversion is performed1      No inversion is performed" range="6" rwaccess="R/W"/>
	<bitfield id="CIR_PULSE_MODE" width="2" begin="5" end="4" resetval="0x0" description="CIR Pulse modulation definition. It defines high level of the pulse width associated with a digit: 0      Pulse width of 3 from 12 cycles1      Pulse width of 4 from 12 cycles2      Pulse width of 5 from 12 cycles3      Pulse width of 6 from 12 cycles" range="5:4" rwaccess="R/W"/>
	<bitfield id="UART_PULSE" width="1" begin="3" end="3" resetval="0x0" description="UART mode only. Used to allow pulse shaping in UART mode. 0      normal UART mode1      UART mode with a pulse shaping" range="3" rwaccess="R/W"/>
	<bitfield id="STS_FIFO_TRIG" width="2" begin="2" end="1" resetval="0x0" description="Only for IR-IRDA mode.Frame Status FIFO Threshold select: 0      1 entry1      4 entries2      7 entries3      8 entries" range="2:1" rwaccess="R/W"/>
	<bitfield id="IRTX_UNDERRUN" width="1" begin="0" end="0" resetval="0x0" description="IRDA Transmission status interrupt.When the IIR[5] interrupt occurs, the meaning of the interrupt is : 0      the last bit of the frame has been       transmitted successfully without error.1      an underrun has occurred. The last bit of       the frame has been transmitted but with an       underrun error present. The bit is reset to       '0' when the RESUME register is read." range="0" rwaccess="R"/>
	</register><register id="UART_SFLSR" acronym="UART_SFLSR" offset="40" width="32" description="IrDA modes only.Reading this register effectively reads frame status information from the status FIFO (this register doesn't physically exist). Reading this register will increment the status FIFO read pointer (SFREGL and SFREGH must be read first).">
		<bitfield id="RESERVED5" width="3" begin="7" end="5" resetval="0x0" description="" range="7:5" rwaccess="R"/>
	<bitfield id="OE_ERROR" width="1" begin="4" end="4" resetval="0x0" description=" 1      Overrun error in RX FIFO when frame at top       of RX FIFO was received." range="4" rwaccess="R"/>
	<bitfield id="FRAME_TOO_LONG_ERROR" width="1" begin="3" end="3" resetval="0x0" description=" 1      Frame-length too long error in frame at top       of RX FIFO." range="3" rwaccess="R"/>
	<bitfield id="ABORT_DETECT" width="1" begin="2" end="2" resetval="0x0" description=" 1      Abort pattern detected in frame at top of       RX FIFO" range="2" rwaccess="R"/>
	<bitfield id="CRC_ERROR" width="1" begin="1" end="1" resetval="0x0" description=" 1      CRC error in frame at top of RX FIFO. top       of RX FIFO = Next frame to be read from RX       FIFO" range="1" rwaccess="R"/>
	<bitfield id="RESERVED0" width="1" begin="0" end="0" resetval="0x0" description="" range="0" rwaccess="R"/>
	</register><register id="UART_TXFLL" acronym="UART_TXFLL" offset="40" width="32" description="IrDA modes only.The registers TXFLL and TXFLH hold the 13-bit transmit frame length (expressed in bytes). TXFLL holds the least significant bits and TXFLH holds the most significant bits. The frame length value is used if the frame length method of frame closing is used.">
		<bitfield id="TXFLL" width="8" begin="7" end="0" resetval="0x0" description="LSB register used to specify the frame length" range="7:0" rwaccess="W"/>
	</register><register id="UART_RESUME" acronym="UART_RESUME" offset="44" width="32" description="IR-IrDA and IR-CIR modes only.This register is used to clear internal flags, which halt transmission/reception when an underrun/overrun error occurs. Reading this register resumes the halted operation. This register does not physically exist and reads always as 0x00.">
		<bitfield id="RESUME" width="8" begin="7" end="0" resetval="0x0" description="Dummy read to restart the TX or RX" range="7:0" rwaccess="R"/>
	</register><register id="UART_TXFLH" acronym="UART_TXFLH" offset="44" width="32" description="IrDA modes only.The registers TXFLL and TXFLH hold the 13-bit transmit frame length (expressed in bytes). TXFLL holds the least significant bits and TXFLH holds the most significant bits. The frame length value is used if the frame length method of frame closing is used.">
		<bitfield id="RESERVED" width="3" begin="7" end="5" resetval="0x0" description="" range="7:5" rwaccess="R"/>
	<bitfield id="TXFLH" width="5" begin="4" end="0" resetval="0x0" description="MSB register used to specify the frame length" range="4:0" rwaccess="W"/>
	</register><register id="UART_RXFLL" acronym="UART_RXFLL" offset="48" width="32" description="IrDA modes only.The registers RXFLL and RXFLH hold the 12-bit receive maximum frame length. RXFLL holds the least significant bits and RXFLH holds the most significant bits. If the intended maximum receive frame length is n bytes, then program RXFLL and RXFLH to be n + 3 in SIR or MIR modes and n + 6 in FIR mode (+3 and +6 are due to frame format with CRC and stop flag; there are two bytes associated with the FIR stop flag).">
		<bitfield id="RXFLL" width="8" begin="7" end="0" resetval="0x0" description="LSB register used to specify the frame length in reception" range="7:0" rwaccess="W"/>
	</register><register id="UART_SFREGL" acronym="UART_SFREGL" offset="48" width="32" description="IrDA modes only.The frame lengths of received frames are written into the status FIFO. This information can be read by reading the SFREGL and SFREGH registers (i.e. these registers do not physically exist). The least significant bits are read from SFREGL and the most significant bits are read from SFREGH. Reading these registers does not alter the status FIFO read pointer. These registers should be read before the pointer is incremented by reading the SFLSR.">
		<bitfield id="SFREGL" width="8" begin="7" end="0" resetval="0x0" description="LSB part of the frame length" range="7:0" rwaccess="R"/>
	</register><register id="UART_RXFLH" acronym="UART_RXFLH" offset="52" width="32" description="IrDA modes only.The registers RXFLL and RXFLH hold the 12-bit receive maximum frame length. RXFLL holds the least significant bits and RXFLH holds the most significant bits. If the intended maximum receive frame length is n bytes, then program RXFLL and RXFLH to be n + 3 in SIR or MIR modes and n + 6 in FIR mode (+3 and +6 are due to frame format with CRC and stop flag; there are two bytes associated with the FIR stop flag).">
		<bitfield id="RESERVED" width="4" begin="7" end="4" resetval="0x0" description="" range="7:4" rwaccess="R"/>
	<bitfield id="RXFLH" width="4" begin="3" end="0" resetval="0x0" description="MSB register used to specify the frame length in reception" range="3:0" rwaccess="W"/>
	</register><register id="UART_SFREGH" acronym="UART_SFREGH" offset="52" width="32" description="IrDA modes only.The frame lengths of received frames are written into the status FIFO. This information can be read by reading the SFREGL and SFREGH registers (i.e. these registers do not physically exist). The least significant bits are read from SFREGL and the most significant bits are read from SFREGH. Reading these registers does not alter the status FIFO read pointer. These registers should be read before the pointer is incremented by reading the SFLSR.">
		<bitfield id="RESERVED" width="4" begin="7" end="4" resetval="0x0" description="" range="7:4" rwaccess="R"/>
	<bitfield id="SFREGH" width="4" begin="3" end="0" resetval="0x0" description="MSB part of the frame length" range="3:0" rwaccess="R"/>
	</register><register id="UART_BLR" acronym="UART_BLR" offset="56" width="32" description="IrDA modes only.Note that BLR[6] is used to select whether 0xC0 or 0xFF start patterns are to be used, when multiple start flags are required in SIR Mode. If only one start flag is required, this will always be 0xC0. If n start flags are required, then either (n-1) 0xC0 or (n-1) 0xFF flags are sent, followed by a single 0xC0 flag (immediately preceding the first data byte).">
		<bitfield id="STS_FIFO_RESET" width="1" begin="7" end="7" resetval="0x0" description="Status FIFO reset. This bit is self-clearing" range="7" rwaccess="R/W1TS"/>
	<bitfield id="XBOF_TYPE" width="1" begin="6" end="6" resetval="0x1" description="SIR xBOF select. 0      0xFF1      0xC0" range="6" rwaccess="R/W"/>
	<bitfield id="RESERVED" width="6" begin="5" end="0" resetval="0x0" description="" range="5:0" rwaccess="R"/>
	</register><register id="UART_UASR" acronym="UART_UASR" offset="56" width="32" description="UART Autobauding Status Register.">
		<bitfield id="PARITY_TYPE" width="2" begin="7" end="6" resetval="0x0" description="00 => No Parity identified. 01 => Parity space. 10 => Even Parity. 11 => Odd Parity" range="7:6" rwaccess="R"/>
	<bitfield id="BIT_BY_CHAR" width="1" begin="5" end="5" resetval="0x0" description="0 => 7 bits character identified. 1 => 8 bits character identified" range="5" rwaccess="R"/>
	<bitfield id="SPEED" width="5" begin="4" end="0" resetval="0x0" description="Used to report the speed identified. 00000 => No speed identified. 00001 => 115200 bauds. 00010 => 57600 bauds. 00011 => 38400 bauds. 00100 => 28800 bauds. 00101 => 19200 bauds. 00110 => 14400 bauds. 00111 =>9600bauds. 01000 =>4800bauds. 01001 =>2400bauds. 01010 =>1200bauds" range="4:0" rwaccess="R"/>
	</register><register id="UART_ACREG" acronym="UART_ACREG" offset="60" width="32" description="IR-IrDA and IR-CIR modes only.">
		<bitfield id="PULSE_TYPE" width="1" begin="7" end="7" resetval="0x0" description="SIR pulse width select: 0      3/16 of baud-rate pulse width1      1.6us" range="7" rwaccess="R/W"/>
	<bitfield id="SD_MOD" width="1" begin="6" end="6" resetval="0x0" description="Primary output used to configure transceivers. Connected to the SD/MODE input pin of IrDA transceivers. 0      SD pin is set to high1      SD pin is set to low" range="6" rwaccess="R/W"/>
	<bitfield id="DIS_IR_RX" width="1" begin="5" end="5" resetval="0x0" description=" 0      Normal operation (RX input automatically       disabled during transmit but enabled       outside of transmit operation).1      Disables RX input (permanent state -       independent of transmit)." range="5" rwaccess="R/W"/>
	<bitfield id="DIS_TX_UNDERRUN" width="1" begin="4" end="4" resetval="0x0" description="It is recommended to disable TX FIFO underrun capability by masking corresponding underrun interrupt. When disabling underrun by setting ACREG[4]=1, garbage data is sent over TX line. 0      Long stop bits cannot be transmitted, TX       underrun is enabled1      Long stop bits can be transmitted, TX       underrun is disabled" range="4" rwaccess="R/W"/>
	<bitfield id="SEND_SIP" width="1" begin="3" end="3" resetval="0x0" description="MIR/FIR Modes only.Send Serial Infrared Interaction Pulse [SIP]If this bit is set during a MIR/FIR transmission, the SIP will be send at the end of it.This bit automatically gets cleared at the end of the SIP transmission. 0      No action1      Send SIP pulse." range="3" rwaccess="R/W1TS"/>
	<bitfield id="SCTX_EN" width="1" begin="2" end="2" resetval="0x0" description="Store and controlled TX start. When MDR1[5] = 1 and the LH writes 1 to this bit the TX state machine starts frame transmission. This bit is self-clearing." range="2" rwaccess="R/W1TS"/>
	<bitfield id="ABORT_EN" width="1" begin="1" end="1" resetval="0x0" description="Frame Abort. The LH can intentionally abort transmission of a frame by Writing 1 to this bit. Neither the end flag nor the CRC bits are appended to the frame.   If transmit FIFO is not empty and MDR1[5]=1, UART IrDA will start a new transfer with data of previous frame as soon as abort frame has been sent. Therefore, TX FIFO must be reset before sending an abort frame." range="1" rwaccess="R/W"/>
	<bitfield id="EOT_EN" width="1" begin="0" end="0" resetval="0x0" description="EOT [end of transmission] bit. The LH writes 1 to this bit just before it writes the last byte to the TX FIFO in set-EOT bit frame closing method. This bit automatically gets cleared when the LH writes to the THR [TX FIFO]." range="0" rwaccess="R/W1TS"/>
	</register><register id="UART_SCR" acronym="UART_SCR" offset="64" width="32" description="Note: Bit 4 enables the wake-up interrupt, but this interrupt is not mapped into the IIR register. Therefore, when an interrupt occurs and there is no interrupt pending in the IIR register, the SSR[1] bit must be checked. To clear the wake-up interrupt, bit SCR[4] must be reset to 0.">
		<bitfield id="RX_TRIG_GRANU1" width="1" begin="7" end="7" resetval="0x0" description=" 0      DISABLES THE GRANULARITY OF 1 FOR TRIGGER       RX LEVEL.1      ENABLES THE GRANULARITY OF 1 FOR TRIGGER RX       LEVEL." range="7" rwaccess="R/W"/>
	<bitfield id="TX_TRIG_GRANU1" width="1" begin="6" end="6" resetval="0x0" description=" 0      DISABLES THE GRANULARITY OF 1 FOR TRIGGER       TX LEVEL.1      Enables the granularity of 1 for trigger TX       level." range="6" rwaccess="R/W"/>
	<bitfield id="DSR_IT" width="1" begin="5" end="5" resetval="0x0" description=" 0      DISABLES DSR* INTERRUPT.1      ENABLES DSR* INTERRUPT." range="5" rwaccess="R/W"/>
	<bitfield id="RX_CTS_DSR_WAKE_UP_ENABLE" width="1" begin="4" end="4" resetval="0x0" description=" 0      DISABLES THE WAKE UP INTERRUPT AND CLEARS       SSR[1].1      Waits for a falling edge of pins RX, CTS*       or DSR* to generate an interrupt" range="4" rwaccess="R/W"/>
	<bitfield id="TX_EMPTY_CTL_IT" width="1" begin="3" end="3" resetval="0x0" description=" 0      Normal mode for THR interrupt (See UART       mode interrupts table).1      THE THR INTERRUPT IS GENERATED WHEN TX FIFO       AND TX SHIFT REGISTER ARE EMPTY." range="3" rwaccess="R/W"/>
	<bitfield id="DMA_MODE_2" width="2" begin="2" end="1" resetval="0x0" description="Used to specify the DMA mode valid if SCR[0] = 1 0      DMA mode 0 (no DMA)1      DMA mode 1 (UART_nDMA_REQ[0] in TX,       UART_nDMA_REQ[1] in RX)2      DMA mode 2 (UART_nDMA_REQ[0] in RX)3      DMA mode 3 (UART_nDMA_REQ[0] in TX)" range="2:1" rwaccess="R/W"/>
	<bitfield id="DMA_MODE_CTL" width="1" begin="0" end="0" resetval="0x0" description=" 0      The DMA_MODE is set with FCR[3]1      The DMA_MODE is set with SCR[2:1]" range="0" rwaccess="R/W"/>
	</register><register id="UART_SSR" acronym="UART_SSR" offset="68" width="32" description="Note: Bit 1 is reset only when SCR[4] is reset to 0.">
		<bitfield id="RESERVED" width="5" begin="7" end="3" resetval="0x0" description="" range="7:3" rwaccess="R"/>
	<bitfield id="DMA_COUNTER_RST" width="1" begin="2" end="2" resetval="0x1" description=" 0      The DMA counter will not be reset if the       corresponding FIFO is reset (via FCR[1] or       FCR[2])1      The DMA counter will be reset if       corresponding FIFO is reset (via FCR[1] or       FCR[2])" range="2" rwaccess="R/W"/>
	<bitfield id="RX_CTS_DSR_WAKE_UP_STS" width="1" begin="1" end="1" resetval="0x0" description=" 0      No falling edge event on RX, CTS* and DSR*1      A falling edge occurred on RX, CTS* or DSR*" range="1" rwaccess="R"/>
