ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263P/UART_UART_52300000h.xml
	<bitfield id="TX_FIFO_FULL" width="1" begin="0" end="0" resetval="0x0" description=" 0      TX FIFO is not full1      TX FIFO is full." range="0" rwaccess="R"/>
	</register><register id="UART_EBLR" acronym="UART_EBLR" offset="72" width="32" description="IR-IrDA and IR-CIR modes only.In IR-IrDA SIR operation, this register specifies the number of BOF + xBOFs to transmit. Value set into this register must take into account the BOF character, therefore to only sent one BOF with no XBOF this register must be set to 1. To send one BOF with N XBOF this register must be set to N+1. Furthermore, the value 0 will send 1 BOF plus 255 XBOF.In IR-IrDA MIR mode, this register specifies the number of additional start flags (MIR protocol mandates a minimum of 2 start flags).In IR-CIR mode, this register specifies the number of consecutive zeros to be received before generating the RX_STOP interrupt (IIR[2]). All the received zeros are stored in the RX FIFO. When the register is set to 0, this feature is de-activated and always in reception state which can be disabled by setting the ACREG[5] to.">
		<bitfield id="EBLR" width="8" begin="7" end="0" resetval="0x0" description="IR-IRDA mode: This register allows to define up to 176 xBOFs, the maximum required by IrDA specification.IR-CIR mode: This register specifies the number of consecutive zeros to be received before generating the RX_STOP interrupt [IIR[2]].0x00: feature disabled.0x01: generate RX_STOP interrupt after receiving one zero bit....0xFF: generate RX_STOP interrupt after receiving 255 zero bits." range="7:0" rwaccess="R/W"/>
	</register><register id="UART_MVR" acronym="UART_MVR" offset="80" width="32" description="The reset value is fixed by hardware and corresponds to the RTL revision of this module. A reset has no effect on the value returnedNotes:	UART / IRDA SIR only module is revision 1.x (WMU_012_1 specification).	UART / IRDA with SIR, MIR and FIR support is revision 2.x (WMU_012_2 specification).	UART / IRDA with SIR, MIR and FIR / CIR support is revision 3.x (this specification).For example: MVR = 0x30 => Version 3.0 MVR = 0x38 => Version 3.8">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="Scheme revision number of module" range="31:30" rwaccess="R"/>
	<bitfield id="FUNC" width="12" begin="27" end="16" resetval="0x1858" description="Function revision number of module" range="27:16" rwaccess="R"/>
	<bitfield id="RTL" width="5" begin="15" end="11" resetval="0x9" description="Rtl revision number of module" range="15:11" rwaccess="R"/>
	<bitfield id="MAJOR" width="3" begin="10" end="8" resetval="0x6" description="Major revision number of the module." range="10:8" rwaccess="R"/>
	<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom revision number of the module." range="7:6" rwaccess="R"/>
	<bitfield id="MINOR" width="6" begin="5" end="0" resetval="0x3" description="Minor revision number of the module." range="5:0" rwaccess="R"/>
	</register><register id="UART_SYSC" acronym="UART_SYSC" offset="84" width="32" description="The auto idle bit controls a power saving technique to reduce the logic power consumption of the OCP interface. That is to say when the feature is enabled, the clock will be gated off until an OCP command for this device has been detected. When the software reset bit is set high it causes a full device reset.">
		<bitfield id="RESERVED" width="3" begin="7" end="5" resetval="0x0" description="" range="7:5" rwaccess="R"/>
	<bitfield id="IDLEMODE" width="2" begin="4" end="3" resetval="0x0" description="POWER MANAGEMENT REQ/ACK CONTROLREF: OCP DESIGN GUIDELINES VERSION 1.1 0      Force idle. An idle request is acknowledged       unconditionally1      No-idle. An idle request is never       acknowledged.2      Smart idle. Acknowledgement to an idle       request is given based in the internal       activity of the module.3      reserved" range="4:3" rwaccess="R/W"/>
	<bitfield id="ENAWAKEUP" width="1" begin="2" end="2" resetval="0x0" description="WAKE UP FEATURE CONTROL 0      Wake up is disabled1      Wake up capability is enabled" range="2" rwaccess="R/W"/>
	<bitfield id="SOFTRESET" width="1" begin="1" end="1" resetval="0x0" description="Software reset. Set this bit to 1 to trigger a module reset. This bit is automatically reset by the hardware. During reads it always returns a 0. 0      Normal mode1      The module is reset" range="1" rwaccess="W"/>
	<bitfield id="AUTOIDLE" width="1" begin="0" end="0" resetval="0x0" description="Internal OCP clock gating strategy 0      Clock is running1      Automatic OCP clock gating strategy is       applied, based on the OCP interface       activity" range="0" rwaccess="R/W"/>
	</register><register id="UART_SYSS" acronym="UART_SYSS" offset="88" width="32" description="">
		<bitfield id="RESERVED" width="7" begin="7" end="1" resetval="0x0" description="" range="7:1" rwaccess="R"/>
	<bitfield id="RESETDONE" width="1" begin="0" end="0" resetval="0x0" description="Internal Reset Monitoring 0      Internal Module Reset is ongoing1      Reset completed" range="0" rwaccess="R"/>
	</register><register id="UART_WER" acronym="UART_WER" offset="92" width="32" description="The UART wakeup enable register is used to mask and unmask a UART event that would subsequently notify the system. The events are any activity in the logic that could cause an interrupt and/ or an activity that would require the system to wakeup. It should be noted that even if the wakeup is disabled for certain events, if these events are also an interrupt to the UART, then the UART will still register the interrupt as such.">
		<bitfield id="EVENT_7_TX_WAKEUP_EN" width="1" begin="7" end="7" resetval="0x1" description=" 0      Event is not allowed to wake up the system1      EVENT CAN WAKE UP THE SYSTEM: Event can be:       THR_IT or TX_DMA request and/or TX_SATUS_IT" range="7" rwaccess="R/W"/>
	<bitfield id="EVENT_6_RECEIVER_LINE_STATUS_INTERRUPT" width="1" begin="6" end="6" resetval="0x1" description=" 0      Event is not allowed to wake up the system1      Event can wake up the system" range="6" rwaccess="R/W"/>
	<bitfield id="EVENT_5_RHR_INTERRUPT" width="1" begin="5" end="5" resetval="0x1" description=" 0      Event is not allowed to wake up the system1      Event can wake up the system" range="5" rwaccess="R/W"/>
	<bitfield id="EVENT_4_RX_ACTIVITY" width="1" begin="4" end="4" resetval="0x1" description=" 0      Event is not allowed to wake up the system1      Event can wake up the system" range="4" rwaccess="R/W"/>
	<bitfield id="EVENT_3_DCD_CD_ACTIVITY" width="1" begin="3" end="3" resetval="0x1" description=" 0      Event is not allowed to wake up the system1      Event can wake up the system" range="3" rwaccess="R/W"/>
	<bitfield id="EVENT_2_RI_ACTIVITY" width="1" begin="2" end="2" resetval="0x1" description=" 0      Event is not allowed to wake up the system1      Event can wake up the system" range="2" rwaccess="R/W"/>
	<bitfield id="EVENT_1_DSR_ACTIVITY" width="1" begin="1" end="1" resetval="0x1" description=" 0      Event is not allowed to wake up the system1      Event can wake up the system" range="1" rwaccess="R/W"/>
	<bitfield id="EVENT_0_CTS_ACTIVITY" width="1" begin="0" end="0" resetval="0x1" description=" 0      Event is not allowed to wake up the system1      Event can wake up the system" range="0" rwaccess="R/W"/>
	</register><register id="UART_CFPS" acronym="UART_CFPS" offset="96" width="32" description="Since the Consumer IR works at modulation rates of 30  56.8 KHz, the 48 MHz clock must be pre scaled before the clock can drive the IR logic. This register sets the divisor rate to give a range to accommodate the remote control requirements in BAUD multiples of 12x. The value of the CFPS at reset is 0105 decimal which equates to a 38.1 KHz output from starting conditions. The 48 MHz carrier is prescaled by the CFPS which is then divided by the 12x BAUD multiple.">
		<bitfield id="CFPS" width="8" begin="7" end="0" resetval="0x105" description="System clock frequency prescaler at [12x multiple]. Examples for CFPS values are given in the table below.Target Freq [KHz]	CFPS [decimal]	Actual Freq[KHz]	30			133		30.08	32.75			122		32.79	36			111		36.04	36.7			109		36.69	38*			105		38.1	40			100		40	56.8			70		57.14* configured at reset to this valueNote: CFPS = 0 is not supported." range="7:0" rwaccess="R/W"/>
	</register><register id="UART_RXFIFO_LVL" acronym="UART_RXFIFO_LVL" offset="100" width="32" description="Level of the RX FIFO.">
		<bitfield id="RXFIFO_LVL" width="8" begin="7" end="0" resetval="0x0" description="" range="7:0" rwaccess="R"/>
	</register><register id="UART_TXFIFO_LVL" acronym="UART_TXFIFO_LVL" offset="104" width="32" description="Level of the TX FIFO.">
		<bitfield id="TXFIFO_LVL" width="8" begin="7" end="0" resetval="0x0" description="" range="7:0" rwaccess="R"/>
	</register><register id="UART_IER2" acronym="UART_IER2" offset="108" width="32" description="Enables RX/TX FIFOs empty corresponding interrupts.">
		<bitfield id="RESERVED1" width="24" begin="31" end="8" resetval="0x0" description="" range="31:8" rwaccess="R"/>
	<bitfield id="RESERVED" width="5" begin="7" end="3" resetval="0x0" description="" range="7:3" rwaccess="R"/>
	<bitfield id="RHR_IT_DIS" width="1" begin="2" end="2" resetval="0x0" description=" 0      Enables the RHR interrupt.1      Disables the RHR interrupt." range="2" rwaccess="R/W"/>
	<bitfield id="EN_TXFIFO_EMPTY" width="1" begin="1" end="1" resetval="0x0" description="Enables[1]/DISABLES[00 EN_TXFIFO_EMPTY interrupt." range="1" rwaccess="R/W"/>
	<bitfield id="EN_RXFIFO_EMPTY" width="1" begin="0" end="0" resetval="0x0" description="Enables[1]/disables[0] EN_RXFIFO_EMPTY interrupt." range="0" rwaccess="R/W"/>
	</register><register id="UART_ISR2" acronym="UART_ISR2" offset="112" width="32" description="Status of  RX/TX FIFOs empty corresponding interrupts.">
		<bitfield id="TXFIFO_EMPTY_STS" width="1" begin="1" end="1" resetval="0x1" description="TXFIFO interrupt pending 0      TXFIFO_EMPTY interrupt not pending.1      TXFIFO_EMPTY interrupt pending." range="1" rwaccess="R/W1TC"/>
	<bitfield id="RXFIFO_EMPTY_STS" width="1" begin="0" end="0" resetval="0x1" description="RXFIFO interrupt pending 0      RXFIFO_EMPTY interrupt not pending.1      RXFIFO_EMPTY interrupt pending." range="0" rwaccess="R/W1TC"/>
	</register><register id="UART_FREQ_SEL" acronym="UART_FREQ_SEL" offset="116" width="32" description="Sample per bit value selector.">
		<bitfield id="FREQ_SEL" width="8" begin="7" end="0" resetval="0x26" description="Sets the sample per bit if non default frequency is used. MDR3[1] must be set to 1 after this value is set. Must be equal or higher then 6." range="7:0" rwaccess="R/W"/>
	</register><register id="UART_ABAUD_1ST_CHAR" acronym="UART_ABAUD_1ST_CHAR" offset="120" width="32" description="Unused.">
		<bitfield id="RESERVED" width="32" begin="31" end="0" resetval="0x0" description="" range="31:0" rwaccess="R"/>
	</register><register id="UART_BAUD_2ND_CHAR" acronym="UART_BAUD_2ND_CHAR" offset="124" width="32" description="Unused.">
		<bitfield id="RESERVED" width="32" begin="31" end="0" resetval="0x0" description="" range="31:0" rwaccess="R"/>
	</register><register id="UART_MDR3" acronym="UART_MDR3" offset="128" width="32" description="Mode definition register 3.">
		<bitfield id="DIR_EN" width="1" begin="4" end="4" resetval="0x0" description="RS-485 External Transceiver Direction Enable" range="4" rwaccess="R/W"/>
	<bitfield id="DIR_POL" width="1" begin="3" end="3" resetval="0x0" description="RS-485 External Transceiver Direction Polarity. 0 => TX: RTS=0, RX: RTS=1. 1 => TX: RTS=1, RX: RTS=0" range="3" rwaccess="R/W"/>
	<bitfield id="SET_DMA_TX_THRESHOLD" width="1" begin="2" end="2" resetval="0x0" description="Enable to set different TX DMA threshold then 64-trigger [usage of new register TX_DNA_THRESHOLD]" range="2" rwaccess="R/W"/>
	<bitfield id="NONDEFAULT_FREQ" width="1" begin="1" end="1" resetval="0x0" description="Enables[1]/Disables[0] using NONDEFAULT  fclk frequencies" range="1" rwaccess="R/W"/>
	<bitfield id="DISABLE_CIR_RX_DEMOD" width="1" begin="0" end="0" resetval="0x0" description="Disables[1]/Enables[0] CIR RX demodulation 0      Enables CIR RX demodulation1      Disables CIR RX demodulation" range="0" rwaccess="R/W"/>
	</register><register id="UART_TX_DMA_THRESHOLD" acronym="UART_TX_DMA_THRESHOLD" offset="132" width="32" description="Use to manually set the TX DMA threshold level.MDR3[2] SET_TX_DMA_THRESHOLD must be one and must be value + tx_trigger_level &#60;= 64 (TX FIFO size).If not, 64-tx_trigger_level will be used w/o modifying the value of this register.">
		<bitfield id="TX_DMA_THRESHOLD" width="6" begin="5" end="0" resetval="0x0" description="Use to manually set the TX DMA threshold level." range="5:0" rwaccess="R/W"/>
	</register><register id="UART_MDR4" acronym="UART_MDR4" offset="136" width="32" description="Mode definition register 4">
		<bitfield id="RESERVED1" width="24" begin="31" end="8" resetval="0x0" description="" range="31:8" rwaccess="R"/>
	<bitfield id="RESERVED" width="1" begin="7" end="7" resetval="0x0" description="" range="7" rwaccess="R"/>
	<bitfield id="MODE9" width="1" begin="6" end="6" resetval="0x0" description="9-bit character length. When '1', overrides character length setting in LCR" range="6" rwaccess="R/W"/>
	<bitfield id="FREQ_SEL_H" width="3" begin="5" end="3" resetval="0x0" description="Upper 3 bits of FREQ_SEL register for higher division values, as required for example for FI/Di in ISO7816 mode" range="5:3" rwaccess="R/W"/>
	<bitfield id="MODE" width="3" begin="2" end="0" resetval="0x0" description="New modes [when set, overrides MDR1 modes] 0      disabled (no override)1      reserved2      Synchronous mode with external clock3      Synchronous mode with generated clock4      ISO 7816 mode T=05      ISO 7816 mode T=16      reserved7      reserved" range="2:0" rwaccess="R/W"/>
	</register><register id="UART_EFR2" acronym="UART_EFR2" offset="140" width="32" description="Enhanced Features Register 2">
		<bitfield id="RESERVED1" width="24" begin="31" end="8" resetval="0x0" description="" range="31:8" rwaccess="R"/>
	<bitfield id="BROADCAST" width="1" begin="7" end="7" resetval="0x0" description="Enables broadcast address matching in multi-drop address match mode" range="7" rwaccess="R/W"/>
	<bitfield id="TIMEOUT_BEHAVE" width="1" begin="6" end="6" resetval="0x0" description="Specifies how timeout is measured 0      timeout after at least one character has       been received1      periodic timeout even when no character has       been received" range="6" rwaccess="R/W"/>
	<bitfield id="C8" width="1" begin="5" end="5" resetval="0x0" description="Value for ISO7816C8 pin for software control" range="5" rwaccess="R/W"/>
	<bitfield id="C4" width="1" begin="4" end="4" resetval="0x0" description="Value for ISO7816C4 pin for software control" range="4" rwaccess="R/W"/>
	<bitfield id="C2" width="1" begin="3" end="3" resetval="0x0" description="Value for ISO7816reset pin [software controllable]" range="3" rwaccess="R/W"/>
	<bitfield id="MULTIDROP" width="1" begin="2" end="2" resetval="0x0" description="Enables parity Multi-drop mode [overrides LCR[5..3]] when '1'" range="2" rwaccess="R/W"/>
	<bitfield id="RHR_OVERRUN" width="1" begin="1" end="1" resetval="0x0" description="RHR Overrun behaviour when buffer full 0      data in RHR is not overwritten (standard)1      data in RHR is overwritten when buffer full       (and FIFO disabled)" range="1" rwaccess="R/W"/>
	<bitfield id="ENDIAN" width="1" begin="0" end="0" resetval="0x0" description="Endianness 0      Little Endian (LSB First)1      Big Endian (MSB First)" range="0" rwaccess="R/W"/>
	</register><register id="UART_ECR" acronym="UART_ECR" offset="144" width="32" description="Enhanced Control register.">
		<bitfield id="RESERVED1" width="24" begin="31" end="8" resetval="0x0" description="" range="31:8" rwaccess="R"/>
	<bitfield id="RESERVED" width="2" begin="7" end="6" resetval="0x0" description="" range="7:6" rwaccess="R"/>
	<bitfield id="CLEAR_TX_PE" width="1" begin="5" end="5" resetval="0x0" description="Write 1 to clear parity error from the Transmitter to allow it to continue to try sending data [ISO7816 transmit only]" range="5" rwaccess="W"/>
	<bitfield id="TX_EN" width="1" begin="4" end="4" resetval="0x1" description="Enables/Disables the transmitter 0      Transmitter is shut down1      Transmitter is working" range="4" rwaccess="R/W"/>
	<bitfield id="RX_EN" width="1" begin="3" end="3" resetval="0x1" description="Enables/Disables the receiver 0      Receiver is shut down1      Receiver is operating" range="3" rwaccess="R/W"/>
	<bitfield id="TX_RST" width="1" begin="2" end="2" resetval="0x0" description="Writing '1' resets the transmitter" range="2" rwaccess="W"/>
	<bitfield id="RX_RST" width="1" begin="1" end="1" resetval="0x0" description="Writing '1' resets the receiver" range="1" rwaccess="W"/>
	<bitfield id="A_MULTIDROP" width="1" begin="0" end="0" resetval="0x0" description="In multi-drop mode, when written with the value '1' causes the next byte written into THR to be transmitted with the parity bit set, signaling an address" range="0" rwaccess="W"/>
	</register><register id="UART_TIMEGUARD" acronym="UART_TIMEGUARD" offset="148" width="32" description="Timeguard.">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="" range="31:8" rwaccess="R"/>
	<bitfield id="TIMEGUARD" width="8" begin="7" end="0" resetval="0x0" description="Specifies the amount of idle baud clocks [transmitter bit period] to  insert between  transmitted bytes, useful when comunicating with slower devices" range="7:0" rwaccess="R/W"/>
	</register><register id="UART_TIMEOUTL" acronym="UART_TIMEOUTL" offset="152" width="32" description="Timeout lower byte.">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="" range="31:8" rwaccess="R"/>
	<bitfield id="TIMEOUT_L" width="8" begin="7" end="0" resetval="0x0" description="Custom timeout period in baud clocks, to override the internal value, when different from 0. [Lower byte of the 16 bit value]" range="7:0" rwaccess="R/W"/>
	</register><register id="UART_TIMEOUTH" acronym="UART_TIMEOUTH" offset="156" width="32" description="Timeout higher byte.">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="" range="31:8" rwaccess="R"/>
	<bitfield id="TIMEOUT_H" width="8" begin="7" end="0" resetval="0x0" description="Custom timeout period in baud clocks, to override the internal value, when different from 0. [Higher byte of the 16 bit value]" range="7:0" rwaccess="R/W"/>
	</register><register id="UART_SCCR" acronym="UART_SCCR" offset="160" width="32" description="Smartcard (ISO7816) mode Control Register.">
		<bitfield id="RESERVED1" width="24" begin="31" end="8" resetval="0x0" description="" range="31:8" rwaccess="R"/>
	<bitfield id="DSNACK" width="1" begin="7" end="7" resetval="0x0" description="Applies Max_Iteration to receiver aswell - when maximum number of NACKs  have been returned, the receiver will accept the data regardless of error. The data will be loaded into the receiver FIFO and PE will be set when Reading it." range="7" rwaccess="R/W"/>
	<bitfield id="INACK" width="1" begin="6" end="6" resetval="0x0" description="Inhibit NACK when receiving, even if an error is received. The data will be loaded into the receiver FIFO and PE will be set when Reading it." range="6" rwaccess="R/W"/>
	<bitfield id="RESERVED" width="3" begin="5" end="3" resetval="0x0" description="" range="5:3" rwaccess="R"/>
	<bitfield id="MAX_ITERATION" width="3" begin="2" end="0" resetval="0x7" description="Number of times to repeat transmitted character, if the receiver did not acknowledge. If not acknowledged after the max value is reached, the UART transmitter will set parity error, stop and not continue until it is cleared." range="2:0" rwaccess="R/W"/>
	</register><register id="UART_ERHR" acronym="UART_ERHR" offset="164" width="32" description="Extended Receive Holding Register.">
		<bitfield id="RESERVED" width="23" begin="31" end="9" resetval="0x0" description="" range="31:9" rwaccess="R"/>
	<bitfield id="ERHR" width="9" begin="8" end="0" resetval="0x0" description="Extended Receive Holding Register - allows accessing the full 9bit RHR" range="8:0" rwaccess="R"/>
	</register><register id="UART_ETHR" acronym="UART_ETHR" offset="164" width="32" description="Extended Transmit Holding Register.">
		<bitfield id="RESERVED" width="23" begin="31" end="9" resetval="0x0" description="" range="31:9" rwaccess="R"/>
	<bitfield id="ETHR" width="9" begin="8" end="0" resetval="0x0" description="Extended Transmit Holding Register - allows Writing the full 9bit RHR" range="8:0" rwaccess="W"/>
	</register><register id="UART_MAR" acronym="UART_MAR" offset="168" width="32" description="Multidrop Address Register.">
		<bitfield id="ADDRESS" width="8" begin="7" end="0" resetval="0x0" description="Multidrop match address value" range="7:0" rwaccess="R/W"/>
	</register><register id="UART_MMR" acronym="UART_MMR" offset="172" width="32" description="Multidrop Mask Register.">
		<bitfield id="MASK" width="8" begin="7" end="0" resetval="0x0" description="Address match masking value ? Writing a 0 to a bit means that the corresponding address bit will be ignored in matching" range="7:0" rwaccess="R/W"/>
	</register><register id="UART_MBR" acronym="UART_MBR" offset="176" width="32" description="Multidrop Broadcast Address Register.">
		<bitfield id="BROADCAST_ADDRESS" width="8" begin="7" end="0" resetval="0x0" description="Broadcast address for address matching" range="7:0" rwaccess="R/W"/>
	</register>
</module>